app/controllers/drafts_controller.rb

SELECT "drafts".* FROM "drafts"
---
  def index
    @drafts = Draft.all

SELECT "drafts".* FROM "drafts" WHERE "drafts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @draft = Draft.find(params[:id])