app/controllers/players_controller.rb

  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("created_at", "name", "position", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 22 Jan 2013 07:00:26 UTC +00:00], ["name", "asas"], ["position", "WD"], ["updated_at", Tue, 22 Jan 2013 07:00:26 UTC +00:00]]

  def destroy
    @player = Player.find(params[:id])
    @player.destroy
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "players" WHERE "players"."id" = $1  [["id", 1]]